4. Pandas Merging and Concatenation

In [2]:
import pandas as pd
data1 = {
    'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'],
    'Age': [27, 24, 22, 32],
    'Address': ['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
    'Qualification': ['Msc', 'MA', 'MCA', 'Phd']
}

# Creating a DataFrame from the dictionary
df = pd.DataFrame(data1)

# Display the DataFrame
print(df)
['Msc', 'MA', 'MCA', 'Phd']

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannuaj           Phd

['Msc', 'MA', 'MCA', 'Phd']

In [3]:
import pandas as pd

# Define the first dictionary containing employee data
data1 = {
    'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'],
    'Age': [27, 24, 22, 32],
    'Address': ['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
    'Qualification': ['Msc', 'MA', 'MCA', 'Phd']
}

# Define the second dictionary containing employee data
data2 = {
    'Name': ['Abhi', 'Ayushi', 'Dhiraj', 'Hitesh'],
    'Age': [17, 14, 12, 52],
    'Address': ['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
    'Qualification': ['Btech', 'B.A', 'Bcom', 'B.hons']
}

# Convert the dictionaries into DataFrames
df = pd.DataFrame(data1, index=[0, 1, 2, 3])
df1 = pd.DataFrame(data2, index=[4, 5, 6, 7])

# Print both DataFrames
print(df, "\n\n", df1)

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannuaj           Phd

      Name  Age    Address Qualification
4    Abhi   17     Nagpur         Btech
5  Ayushi   14     Kanpur           B.A
6  Dhiraj   12  Allahabad          Bcom
7  Hitesh   52    Kannuaj        B.hons

In [4]:
frames=[df,df1]
res1 = pd.concat(frames)
res1

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannuaj           Phd
4    Abhi   17     Nagpur         Btech
5  Ayushi   14     Kanpur           B.A
6  Dhiraj   12  Allahabad          Bcom
7  Hitesh   52    Kannuaj        B.hons

In [5]:
import pandas as pd

data1 = {'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'], 
         'Age': [27, 24, 22, 32], 
         'Address': ['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
         'Qualification': ['Msc', 'MA', 'MCA', 'Phd']} 

data2 = {'Name': ['Abhi', 'Ayushi', 'Dhiraj', 'Hitesh'], 
         'Age': [17, 14, 12, 52], 
         'Address': ['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
         'Qualification': ['Btech', 'B.A', 'Bcom', 'B.hons']} 

# Convert the dictionaries into DataFrames
df = pd.DataFrame(data1, index=[0, 1, 2, 3])

df1 = pd.DataFrame(data2, index=[4, 5, 6, 7])

print(df, "\n\n", df1)

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannuaj           Phd

      Name  Age    Address Qualification
4    Abhi   17     Nagpur         Btech
5  Ayushi   14     Kanpur           B.A
6  Dhiraj   12  Allahabad          Bcom
7  Hitesh   52    Kannuaj        B.hons

In [8]:
df = pd.DataFrame(data1)
df1 = pd.DataFrame(data2)

print(df , "\n\n" , df1)
res = pd.merge(df,df1,on='Address')
res

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannuaj           Phd

      Name  Age    Address Qualification
0    Abhi   17     Nagpur         Btech
1  Ayushi   14     Kanpur           B.A
2  Dhiraj   12  Allahabad          Bcom
3  Hitesh   52    Kannuaj        B.hons

   Name_x  Age_x    Address Qualification_x  Name_y  Age_y Qualification_y
0     Jai     27     Nagpur             Msc    Abhi     17           Btech
1  Princi     24     Kanpur              MA  Ayushi     14             B.A
2  Gaurav     22  Allahabad             MCA  Dhiraj     12            Bcom
3    Anuj     32    Kannuaj             Phd  Hitesh     52          B.hons

In [9]:
data1 = {'key':['k0','k1','k2','k3'],
    'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'], 
         'Age': [27, 24, 22, 32], 
         'Address': ['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
         'Qualification': ['Msc', 'MA', 'MCA', 'Phd']} 

data2 = {'key':['k0','k1','k2','k3'],
    'Name': ['Abhi', 'Ayushi', 'Dhiraj', 'Hitesh'], 
         'Age': [17, 14, 12, 52], 
         'Address': ['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
         'Qualification': ['Btech', 'B.A', 'Bcom', 'B.hons']} 
df = pd.DataFrame(data1)
df1 = pd.DataFrame(data2)

print(df , "\n\n" , df1)
res = pd.merge(df,df1,on='key')
res

  key    Name  Age    Address Qualification
0  k0     Jai   27     Nagpur           Msc
1  k1  Princi   24     Kanpur            MA
2  k2  Gaurav   22  Allahabad           MCA
3  k3    Anuj   32    Kannuaj           Phd

   key    Name  Age    Address Qualification
0  k0    Abhi   17     Nagpur         Btech
1  k1  Ayushi   14     Kanpur           B.A
2  k2  Dhiraj   12  Allahabad          Bcom
3  k3  Hitesh   52    Kannuaj        B.hons

,key,Name_x,Age_x,Address_x,Qualification_x,Name_y,Age_y,Address_y,Qualification_y
0,k0,Jai,27,Nagpur,Msc,Abhi,17,Nagpur,Btech
1,k1,Princi,24,Kanpur,MA,Ayushi,14,Kanpur,B.A
2,k2,Gaurav,22,Allahabad,MCA,Dhiraj,12,Allahabad,Bcom
3,k3,Anuj,32,Kannuaj,Phd,Hitesh,52,Kannuaj,B.hons

In [10]:
data1 = {'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'], 
         'Age': [27, 24, 22, 32], 
         } 

data2 = {'Address': ['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
         'Qualification': ['Btech', 'B.A', 'Bcom', 'B.hons']} 

df = pd.DataFrame(data1,index=['k0','k1','k2','k3'])
df1 = pd.DataFrame(data2,index=['k0','k1','k2','k3'])
print(df , "\n\n" , df1)

res = df.join(df1)
res

      Name  Age
k0     Jai   27
k1  Princi   24
k2  Gaurav   22
k3    Anuj   32

       Address Qualification
k0     Nagpur         Btech
k1     Kanpur           B.A
k2  Allahabad          Bcom
k3    Kannuaj        B.hons

      Name  Age    Address Qualification
k0     Jai   27     Nagpur         Btech
k1  Princi   24     Kanpur           B.A
k2  Gaurav   22  Allahabad          Bcom
k3    Anuj   32    Kannuaj        B.hons